---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrFirstRiser
source: html/24472787-703b-eafc-00ad-d28e32ce4e54.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrFirstRiser Property

"Begin with Riser"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrFirstRiser { get; }
```